# SF Salaries - Panda Skill Exercise
#### SF Salaries Data set from Kaggle

In [3]:
import pandas as pd # import of panda library with import function

In [5]:
df=pd.read_csv('Salaries.csv') # read csv is the method of importing files for further analysis

In [8]:
df.head() # head function brings first 5 rows of the file

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [10]:
df.tail() # tail function reflects last 5 rows

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [12]:
df.info() # info function reflects total null data, Data Type, columns types,

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [13]:
df.columns # reflects the number of columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [15]:
df['BasePay'].mean() # Square bracket [] is used to define mutable data types - lists. 
# List comprehension for indexing/looup/slicing. 
# **Explanation** : Our defined df lookup in BasePay colum and average out entire column
# $66325 is average Base Pay

66325.44884050643

In [16]:
df['OvertimePay'].max() # max function is used for finding maximum amount in the given colum.
# once again Square bracket is used for indexing
# $245131- is maximum amount paid as overtime pay

245131.88

In [25]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']
# from the df Slice colum employeename equals Joseph Driscoll and then from df jobtitle to reach the jobtitle

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [22]:
df.EmployeeName # looking for Employee name details from EmployeeName Colums

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148649        Roy I Tillery
148650         Not provided
148651         Not provided
148652         Not provided
148653            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object

In [28]:
df[df['JobTitle']=='WIRE ROPE CABLE MAINTENANCE MECHANIC']['EmployeeName']
# from the df Slice colum jobtitle equals WIRE ROPE CABLE MAINTENANCE MECHANIC and then from df EmployeeName to reach the jobtitle

3        CHRISTOPHER CHONG
2259         LEWIS HAZZARD
3311          PETER CONIDI
5277           EDDIE SZETO
7725         GREGORY ADAMS
7868          EDWIN DINOZO
7910         STEVEN CASHEN
10830       MICHAEL RIVERA
Name: EmployeeName, dtype: object

In [29]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']
# How much Joseph Driscoll makes money = $270324

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [45]:
# what is the name of the highest paid person (including benefits)
df[df['TotalPayBenefits']==df['TotalPayBenefits'].max()]
# Approach is slice Total pay benefits with max and then look at in Total pay benefits df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [47]:
# what is the name of the lowest paid person (including benefits)
df[df['TotalPayBenefits']==df['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [59]:
# what is the average basepay of all employees per year (2011 - 2014)
df['Year'].value_counts() # value_counts() function returns object containing counts of unique values

2014    38123
2013    37606
2012    36766
2011    36159
Name: Year, dtype: int64

In [71]:
df.groupby('Year').mean()['BasePay'] # () - paranthasis is tuple immutable 
# groupby function is used for grouping based on year or based on name, age etc as per the given problem

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [78]:
# how many unique job titles
df['JobTitle'].nunique() #nunique reflects number of unique title in numbers

2159

In [83]:
df['JobTitle'].unique() # unique reflects the number of unique title names in detail

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

In [87]:
# what the top most 5 unique job
df['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [89]:
# * How many Job Titles were represented by only one person in 2013? 
#(e.g. Job Titles with only one occurence in 2013?)

In [98]:
sum(df[df['Year']==2013]['JobTitle'].value_counts()==1)

202

In [119]:
#How many people have the word Chef in their job title

In [133]:
def findchief(x):
    if 'chief' in x.lower():
        return True
    else:
        return False

In [134]:
sum(df['JobTitle'].apply(lambda x: findchief(x)))

627

##### Bonus: Is there a correlation between length of the Job Title string and Salary?

In [146]:
#lenght function : len() Function The len() function returns the number of items in an object. 
# When the object is a string, the len() function returns the number of characters in the string

df['Title_length'] = df['JobTitle'].apply(len)
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,Title_length
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,46
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN,31
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN,31
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN,36
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN,44

In [148]:
df[['Title_length','TotalPayBenefits']].corr() # corr function is used to find relationship between 2 functions

                  Title_length  TotalPayBenefits
Title_length          1.000000         -0.036878
TotalPayBenefits     -0.036878          1.000000

1. -1 indicates a perfectly negative linear correlation between two variables.
2.  0 indicates no linear correlation between two variables.
3.  1 indicates a perfectly positive linear correlation between two variables.

Summary : Length of the title is negatively corellated with Total pay benefits

# Good Job